Revit 2024 API
TopographySurface.ArePointsDistinct Method
 Identify whether the input points are distinct in XY location.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public static bool ArePointsDistinct(
	IList<XYZ> points
)
Visual Basic
Public Shared Function ArePointsDistinct ( _
	points As IList(Of XYZ) _
) As Boolean
Visual C++
public:
static bool ArePointsDistinct(
	IList<XYZ^>^ points
)
Parameters
points
Type: System.Collections.Generic.IList<XYZ>
 The points set to be checked.
Return Value
 True if all points are distinct after ignoring the elevations, otherwise false.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  There are no points in the input points set.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
TopographySurface Class
Autodesk.Revit.DB.Architecture Namespace